Can't keep wall and [target] joined
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotKeepWallJoinToRoofError { get; }
  Visual Basic
Public Shared ReadOnly Property CannotKeepWallJoinToRoofError As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotKeepWallJoinToRoofError {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures JoinElementsFailures Class
  Autodesk.Revit.DB Namespace